<a href="https://colab.research.google.com/github/cristiandarioortegayubro/dataidea/blob/main/meeting_06.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<center>

![Logo.png]()

#**Módulo Pandas**

## Habilitando los módulos

Habitualmente se habilitan los módulos de la siguiente forma:

In [1]:
import pandas as pd
import numpy as np

## Obteniendo los datos

In [2]:
URL = "https://raw.githubusercontent.com/LucaAPiattelli/Diplomatura_Business_Analytics_UDA/main/Modulo_07_Introduccion_a_Python/"

In [3]:
archivo = "Analisis_de_Facturas_de_Venta.csv"

In [4]:
direccion = URL + archivo

## Creación del DataFrame

In [5]:
ventas = pd.read_csv(direccion)

In [6]:
ventas

           DOCUMENTO  ...            MONEDA
0    B-0001-00000102  ...  Pesos Argentinos
1    B-0001-00000101  ...  Pesos Argentinos
2    A-0001-00000231  ...  Pesos Argentinos
3    A-0001-00000230  ...  Pesos Argentinos
4    A-0001-00000229  ...  Pesos Argentinos
..               ...  ...               ...
154  A-0001-00000128  ...  Pesos Argentinos
155  B-0001-00000069  ...  Pesos Argentinos
156  B-0001-00000069  ...  Pesos Argentinos
157  B-0001-00000068  ...  Pesos Argentinos
158  B-0001-00000068  ...  Pesos Argentinos

[159 rows x 9 columns]

## Visualizaciones del DataFrame

In [7]:
ventas.head() # vista de las primeras 5 filas del dataframe

         DOCUMENTO      ORGANIZACION  ... IMPORTEMONTRANSACCION            MONEDA
0  B-0001-00000102      Etigand S.A.  ...             289256.20  Pesos Argentinos
1  B-0001-00000101     Javier Moroni  ...              99586.78  Pesos Argentinos
2  A-0001-00000231      Amazon Group  ...              59700.00  Pesos Argentinos
3  A-0001-00000230      Amazon Group  ...             310740.00  Pesos Argentinos
4  A-0001-00000229  Manganello S.R.L  ...             315000.00  Pesos Argentinos

[5 rows x 9 columns]

In [8]:
ventas.head(10) # vista de las primeras 10 filas del dataframe

         DOCUMENTO      ORGANIZACION  ... IMPORTEMONTRANSACCION            MONEDA
0  B-0001-00000102      Etigand S.A.  ...             289256.20  Pesos Argentinos
1  B-0001-00000101     Javier Moroni  ...              99586.78  Pesos Argentinos
2  A-0001-00000231      Amazon Group  ...              59700.00  Pesos Argentinos
3  A-0001-00000230      Amazon Group  ...             310740.00  Pesos Argentinos
4  A-0001-00000229  Manganello S.R.L  ...             315000.00  Pesos Argentinos
5  A-0001-00000228     Galardon S.A.  ...             234807.00  Pesos Argentinos
6  A-0001-00000227          Klarkson  ...              61830.00  Pesos Argentinos
7  A-0001-00000226    Juan Fernández  ...             370620.00  Pesos Argentinos
8  A-0001-00000225    Horizonte S.A.  ...             233550.00  Pesos Argentinos
9  A-0001-00000224      Amazon Group  ...               6700.00  Pesos Argentinos

[10 rows x 9 columns]

In [9]:
ventas.tail() # vista de las ultimas 5 filas del dataframe

           DOCUMENTO  ...            MONEDA
154  A-0001-00000128  ...  Pesos Argentinos
155  B-0001-00000069  ...  Pesos Argentinos
156  B-0001-00000069  ...  Pesos Argentinos
157  B-0001-00000068  ...  Pesos Argentinos
158  B-0001-00000068  ...  Pesos Argentinos

[5 rows x 9 columns]

In [10]:
ventas.tail(7) # vista de las ultimas 7 filas del dataframe

           DOCUMENTO  ...            MONEDA
152  B-0001-00000070  ...  Pesos Argentinos
153  A-0001-00000129  ...  Pesos Argentinos
154  A-0001-00000128  ...  Pesos Argentinos
155  B-0001-00000069  ...  Pesos Argentinos
156  B-0001-00000069  ...  Pesos Argentinos
157  B-0001-00000068  ...  Pesos Argentinos
158  B-0001-00000068  ...  Pesos Argentinos

[7 rows x 9 columns]

In [11]:
ventas.index

RangeIndex(start=0, stop=159, step=1)

In [12]:
ventas.columns

Index(['DOCUMENTO', 'ORGANIZACION', 'FECHA', 'TIPOFACTURA', 'PRODUCTO',
       'CANTIDAD', 'PRECIO', 'IMPORTEMONTRANSACCION', 'MONEDA'],
      dtype='object')

## Tipos de datos del DataFrame y tamaño

In [13]:
ventas.dtypes

DOCUMENTO                 object
ORGANIZACION              object
FECHA                     object
TIPOFACTURA               object
PRODUCTO                  object
CANTIDAD                 float64
PRECIO                   float64
IMPORTEMONTRANSACCION    float64
MONEDA                    object
dtype: object

In [14]:
ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   DOCUMENTO              159 non-null    object
 1   ORGANIZACION           159 non-null    object
 2   FECHA                  159 non-null    object
 3   TIPOFACTURA            159 non-null    object
 4   PRODUCTO               159 non-null    object
 5   CANTIDAD               159 non-null    float64
 6   PRECIO                 159 non-null    float64
 7   IMPORTEMONTRANSACCION  159 non-null    float64
 8   MONEDA                 159 non-null    object
dtypes: float64(3), object(6)
memory usage: 11.3+ KB

In [15]:
ventas.shape

(159, 9)

Se puede observar que Fecha tiene un tipo de dato que no corresponde, entonces se procede a cambiar el tipo de dato al que debe ser...

## Trabajando en el DataFrame

### Cambiando el tipo de dato de una columna

In [16]:
ventas["FECHA"] = pd.to_datetime(ventas.FECHA)

In [17]:
ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   DOCUMENTO              159 non-null    object
 1   ORGANIZACION           159 non-null    object
 2   FECHA                  159 non-null    datetime64[ns]
 3   TIPOFACTURA            159 non-null    object
 4   PRODUCTO               159 non-null    object
 5   CANTIDAD               159 non-null    float64
 6   PRECIO                 159 non-null    float64
 7   IMPORTEMONTRANSACCION  159 non-null    float64
 8   MONEDA                 159 non-null    object
dtypes: datetime64[ns](1), float64(3), object(5)
memory usage: 11.3+ KB

### Cambiando el nombre de una columna

In [20]:
ventas.rename(columns={"IMPORTEMONTRANSACCION":"TOTAL"}, inplace=True)

In [21]:
ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   DOCUMENTO     159 non-null    object
 1   ORGANIZACION  159 non-null    object
 2   FECHA         159 non-null    datetime64[ns]
 3   TIPOFACTURA   159 non-null    object
 4   PRODUCTO      159 non-null    object
 5   CANTIDAD      159 non-null    float64
 6   PRECIO        159 non-null    float64
 7   TOTAL         159 non-null    float64
 8   MONEDA        159 non-null    object
dtypes: datetime64[ns](1), float64(3), object(5)
memory usage: 11.3+ KB

## Primeros calculos estadisticos

### Resumen

In [22]:
ventas.describe()

         CANTIDAD         PRECIO          TOTAL
count  159.000000     159.000000     159.000000
mean     7.383648   24021.195378   58406.882767
std     11.455914   30051.944155   73240.581780
min      1.000000     107.438000     123.970000
25%      1.000000    3500.000000   14525.000000
50%      1.000000   12000.000000   31404.960000
75%     10.000000   32249.500000   71570.250000
max     60.000000  165980.000000  370620.000000

In [24]:
ventas.TOTAL.describe()

count       159.000000
mean      58406.882767
std       73240.581780
min         123.970000
25%       14525.000000
50%       31404.960000
75%       71570.250000
max      370620.000000
Name: TOTAL, dtype: float64

### Media

In [27]:
ventas.TOTAL.mean()

58406.882767295596

### Mediana

In [28]:
ventas.TOTAL.median()

31404.96

### Desviación estándar

In [29]:
ventas.TOTAL.std()

73240.58177980126

### Cuartiles

In [30]:
ventas.PRECIO.quantile(q=0.25)

3500.0

In [31]:
ventas.PRECIO.quantile(q=0.50)

12000.0

In [32]:
ventas.PRECIO.quantile(q=0.75)

32249.5

### Minimo

In [33]:
ventas.PRECIO.min()

107.438

### Maximo

In [34]:
ventas.PRECIO.max()

165980.0

### Sesgo

In [35]:
ventas.PRECIO.skew()

1.9922846974676405

### Rango

In [36]:
rango = ventas.PRECIO.max() - ventas.PRECIO.min()
rango

165872.562

### Curtosis

In [37]:
ventas.PRECIO.kurtosis()

4.5892711892806215

### Valores únicos

In [38]:
ventas.nunique()

DOCUMENTO       138
ORGANIZACION     20
FECHA           127
TIPOFACTURA       1
PRODUCTO         23
CANTIDAD         23
PRECIO          125
TOTAL           134
MONEDA            2
dtype: int64

# Otro ejemplo

## Habilitando módulo

In [39]:
import pandas_datareader as data

## Obteniendo datos remotos

In [40]:
MELI = data.DataReader("MELI", start="2021-01-01", data_source="yahoo")

## Creando el DataFrame

In [41]:
df = pd.DataFrame(MELI)
df.head()

                   High          Low  ...   Volume    Adj Close
Date                                  ...
2021-01-04  1725.000000  1612.569946  ...   851000  1640.000000
2021-01-05  1704.250000  1630.000000  ...   530400  1650.000000
2021-01-06  1627.319946  1564.949951  ...   584700  1571.979980
2021-01-07  1629.329956  1570.569946  ...  1170800  1597.969971
2021-01-08  1719.260010  1612.829956  ...   737300  1719.000000

[5 rows x 6 columns]

## Trabajando en el DataFrame

### Insertando columna Date

In [42]:
df.insert(0,column="Date",value=df.index.values)
df.head()

                 Date         High  ...   Volume    Adj Close
Date                                ...
2021-01-04 2021-01-04  1725.000000  ...   851000  1640.000000
2021-01-05 2021-01-05  1704.250000  ...   530400  1650.000000
2021-01-06 2021-01-06  1627.319946  ...   584700  1571.979980
2021-01-07 2021-01-07  1629.329956  ...  1170800  1597.969971
2021-01-08 2021-01-08  1719.260010  ...   737300  1719.000000

[5 rows x 7 columns]

### Reseteando el Index

In [43]:
df.reset_index(drop=True, inplace=True)
df.head()

        Date         High          Low  ...        Close   Volume    Adj Close
0 2021-01-04  1725.000000  1612.569946  ...  1640.000000   851000  1640.000000
1 2021-01-05  1704.250000  1630.000000  ...  1650.000000   530400  1650.000000
2 2021-01-06  1627.319946  1564.949951  ...  1571.979980   584700  1571.979980
3 2021-01-07  1629.329956  1570.569946  ...  1597.969971  1170800  1597.969971
4 2021-01-08  1719.260010  1612.829956  ...  1719.000000   737300  1719.000000

[5 rows x 7 columns]

## Insertando una columna con el nombre del día

In [44]:
df.insert(1,column="Day",value=pd.DatetimeIndex(df["Date"]).day_name())
df.head()

        Date        Day         High  ...        Close   Volume    Adj Close
0 2021-01-04     Monday  1725.000000  ...  1640.000000   851000  1640.000000
1 2021-01-05    Tuesday  1704.250000  ...  1650.000000   530400  1650.000000
2 2021-01-06  Wednesday  1627.319946  ...  1571.979980   584700  1571.979980
3 2021-01-07   Thursday  1629.329956  ...  1597.969971  1170800  1597.969971
4 2021-01-08     Friday  1719.260010  ...  1719.000000   737300  1719.000000

[5 rows x 8 columns]

## Insertando una columna con el nombre del mes

In [45]:
df.insert(2,column="Month",value=pd.DatetimeIndex(df["Date"]).month_name())
df.head()

        Date        Day    Month  ...        Close   Volume    Adj Close
0 2021-01-04     Monday  January  ...  1640.000000   851000  1640.000000
1 2021-01-05    Tuesday  January  ...  1650.000000   530400  1650.000000
2 2021-01-06  Wednesday  January  ...  1571.979980   584700  1571.979980
3 2021-01-07   Thursday  January  ...  1597.969971  1170800  1597.969971
4 2021-01-08     Friday  January  ...  1719.000000   737300  1719.000000

[5 rows x 9 columns]

## Calculando el cambio porcentual

In [46]:
df["Pct_Change"] = df.Close.pct_change()
df.head()

        Date        Day    Month  ...   Volume    Adj Close  Pct_Change
0 2021-01-04     Monday  January  ...   851000  1640.000000         NaN
1 2021-01-05    Tuesday  January  ...   530400  1650.000000    0.006098
2 2021-01-06  Wednesday  January  ...   584700  1571.979980   -0.047285
3 2021-01-07   Thursday  January  ...  1170800  1597.969971    0.016533
4 2021-01-08     Friday  January  ...   737300  1719.000000    0.075740

[5 rows x 10 columns]

## Calculando la diferencia

In [47]:
df["Diff"] = df.Close.diff()
df.head()

        Date        Day    Month  ...    Adj Close  Pct_Change        Diff
0 2021-01-04     Monday  January  ...  1640.000000         NaN         NaN
1 2021-01-05    Tuesday  January  ...  1650.000000    0.006098   10.000000
2 2021-01-06  Wednesday  January  ...  1571.979980   -0.047285  -78.020020
3 2021-01-07   Thursday  January  ...  1597.969971    0.016533   25.989990
4 2021-01-08     Friday  January  ...  1719.000000    0.075740  121.030029

[5 rows x 11 columns]

## Eliminando columnas

In [48]:
df.drop(["High","Low","Open","Volume", "Adj Close"], axis=1, inplace=True)

In [49]:
df

         Date        Day    Month        Close  Pct_Change        Diff
0  2021-01-04     Monday  January  1640.000000         NaN         NaN
1  2021-01-05    Tuesday  January  1650.000000    0.006098   10.000000
2  2021-01-06  Wednesday  January  1571.979980   -0.047285  -78.020020
3  2021-01-07   Thursday  January  1597.969971    0.016533   25.989990
4  2021-01-08     Friday  January  1719.000000    0.075740  121.030029
..        ...        ...      ...          ...         ...         ...
92 2021-05-17     Monday      May  1336.780029    0.010339   13.680054
93 2021-05-18    Tuesday      May  1346.060059    0.006942    9.280029
94 2021-05-19  Wednesday      May  1322.310059   -0.017644  -23.750000
95 2021-05-20   Thursday      May  1374.989990    0.039839   52.679932
96 2021-05-21     Friday      May  1367.119995   -0.005724   -7.869995

[97 rows x 6 columns]

## Eliminando NaN

In [50]:
df.dropna(how='any', inplace=True)
df.head()

        Date        Day    Month        Close  Pct_Change        Diff
1 2021-01-05    Tuesday  January  1650.000000    0.006098   10.000000
2 2021-01-06  Wednesday  January  1571.979980   -0.047285  -78.020020
3 2021-01-07   Thursday  January  1597.969971    0.016533   25.989990
4 2021-01-08     Friday  January  1719.000000    0.075740  121.030029
5 2021-01-11     Monday  January  1761.550049    0.024753   42.550049

In [53]:
df.shape

(96, 6)

In [51]:
df.reset_index(drop=True, inplace=True)

In [52]:
df

         Date        Day    Month        Close  Pct_Change        Diff
0  2021-01-05    Tuesday  January  1650.000000    0.006098   10.000000
1  2021-01-06  Wednesday  January  1571.979980   -0.047285  -78.020020
2  2021-01-07   Thursday  January  1597.969971    0.016533   25.989990
3  2021-01-08     Friday  January  1719.000000    0.075740  121.030029
4  2021-01-11     Monday  January  1761.550049    0.024753   42.550049
..        ...        ...      ...          ...         ...         ...
91 2021-05-17     Monday      May  1336.780029    0.010339   13.680054
92 2021-05-18    Tuesday      May  1346.060059    0.006942    9.280029
93 2021-05-19  Wednesday      May  1322.310059   -0.017644  -23.750000
94 2021-05-20   Thursday      May  1374.989990    0.039839   52.679932
95 2021-05-21     Friday      May  1367.119995   -0.005724   -7.869995

[96 rows x 6 columns]